Examinator/src/Catalogs/УчебныеГруппыСУО/УчебныеГруппыСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчебныеГруппыСУО</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоЭлементаСправочникаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/УчебныеГруппыСУО/Forms/ФормаЭлемента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Функция ПоместитьСписокПользователейВХранилище()
	
	ВременнаяТаблицаПользователей = Новый ТаблицаЗначений();
	ВременнаяТаблицаПользователей.Колонки.Добавить("Пользователь");
	ВременнаяТаблицаПользователей.Колонки.Добавить("Наименование");
	
	Для каждого Строка Из Объект.Состав Цикл
	
		НоваяСтрока = ВременнаяТаблицаПользователей.Добавить();
		НоваяСтрока.Пользователь = Строка.Пользователь;
		НоваяСтрока.Наименование = Строка.Пользователь.Наименование;
	
	КонецЦикла;
	
	ЗаголовокФормыПодбора = НСтр("ru = 'Подбор пользователей'");
	ПараметрыРасширеннойФормыПодбора = 
		Новый Структура("ЗаголовокФормыПодбора, ВыбранныеПользователи, ПодборГруппНевозможен",
		                 ЗаголовокФормыПодбора, ВременнаяТаблицаПользователей, Истина);
	АдресХранилища = ПоместитьВоВременноеХранилище(ПараметрыРасширеннойФормыПодбора, УникальныйИдентификатор);
	Возврат АдресХранилища;	
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЕстьПравоИзменения = ПравоДоступа("Изменение", Метаданные.Справочники.УчебныеГруппыСУО);
	
	Если НЕ ЕстьПравоИзменения Тогда
		Элементы.Состав.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
		ЭтотОбъект.ПоложениеКоманднойПанели      = ПоложениеКоманднойПанелиФормы.Нет;
		Элементы.ОсновныеРеквизиты.Видимость     = Ложь;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов	
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	АдресСпискаВХранилище = ПоместитьСписокПользователейВХранилище();
	
	ПараметрыФормы = Новый Структура("ПараметрыРасширеннойФормыПодбора, РасширенныйПодбор", АдресСпискаВХранилище, Истина);
	ОткрытьФорму("ОбщаяФорма.ПодборПользователейСУО", ПараметрыФормы, Элементы.Состав);

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ Состав

&НаКлиенте
Процедура СоставОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда		
		Возврат;		
	КонецЕсли;
	
	Объект.Состав.Очистить();
	
	Для каждого ВыбранныйПользователь Из ВыбранноеЗначение Цикл
			
		НоваяСтрока = Объект.Состав.Добавить();
		НоваяСтрока.Пользователь = ВыбранныйПользователь; 
			
	КонецЦикла;

КонецПроцедуры
